<?php
$products = [
    [
        "name" => "iPhone 13",
        "image" => "https://dkstatics-public.digikala.com/digikala-products/ec9a962187e1f82cc47e7a148ef99ec1c6fd024d_1656423336.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
        "description" => "گوشی موبایل iPhone 13 CH پرچم‌دار جدید شرکت اپل است که با چند ویژگی جدید و دوربین دوگانه روانه بازار شده است. نمایشگر آیفون 13 به پنل Super Retina مجهز ‌شده است تا تصاویر بسیار مطلوبی را به کاربر عرضه کند. این نمایشگر رزولوشن بسیار بالایی دارد؛ به‌طوری‌که در اندازه­‌ی 6.1 اینچی‌اش، حدود 460 پیکسل را در هر اینچ جا داده است. امکان شارژ بی‌‌سیم باتری در این گوشی وجود دارد. تشخیص چهره با استفاده از دوربین جلو دیگر ویژگی است که در آیفون جدید اپل به کار گرفته شده است. از نظر سخت‌‌افزاری این گوشی از تراشه­‌ی جدید A15 بهره می‌برد که دارای 15 میلیارد ترانزیستور است که دارای کنترل گرمای مطلوبی بوده که تا بتواند علاوه بر کارهای معمول، از قابلیت‌های جدید واقعیت مجازی که اپل این روزها روی آن تمرکز خاصی دارد، پشتیبانی کند.",
        "stock" => "8",
        "colors" => ["مشکی", "سفید", "قرمز", "سبز"]
    ],
    [
        "name" => "S23 Ultra",
        "image" => "https://dkstatics-public.digikala.com/digikala-products/ebe1b2041a76fda30ce7b8870ddfd627f5affa2a_1681800756.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
        "description" => "
        سامسونگ Galaxy S23 Ultra به‌عنوان گل سرسبد گوشی‌های هوشمند خانواده S23 با بهره بردن از مشخصات فنی قدرتمند معرفی شد. در نگاه اول از نظر طراحی در نظر گرفته شده، سامسونگ Galaxy S23 Ultra به نسبت نسل قبلی یعنی Galaxy S22 Ultra تغییرات زیادی نداشته و تقریبا هر دو گوشی از طراحی مشابهی بهره بردند. اما باید بدانید که Galaxy S23 Ultra به نسبت نسل قبلی، قدرتمند‌تر از همیشه وارد میدان رقابت شده است. در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش شگفت‌انگیز با ابعاد 6.8 اینچ و رزولوشن 1440×3088 پیکسل از نوع Dynamic AMOLED 2X مجهز شده. از جمله قابلیت‌های قدرتمند این صفحه‌نمایش می‌توانیم به توانایی نمایش 501 پیکسل در هر اینچ، نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1750 نیت (nits) اشاره کنیم. ",
        "stock" => "10",
        "colors" => ["مشکی", "سبز"]
    ],
    [
        "name" => "MacBook Pro MNWA3 2023",
        "image" => "https://dkstatics-public.digikala.com/digikala-products/89171768e960856ac5940e4d8bc750758cd10eb0_1683368694.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
        "description" => "لپ تاپ MacBook Pro MNWA3 2023 یکی از جدیدترین لپ تاپ های شرکت اپل است که در سال 2023 معرفی شده است. این لپ تاپ دارای صفحه نمایش 16.2 اینچی با رزولوشن 3456x2234 پیکسل است و با فناوری True Tone بهترین تجربه بصری را برای کاربران خود به ارمغان می‌آورد. این لپ تاپ دارای پردازنده قدرتمند M2 Pro با 32 گیگابایت رم است و می‌تواند برای برنامه های سنگین را به راحتی اجرا کند. همچنین، این لپ تاپ دارای یک ترابایت فضای ذخیره سازی SSD است که به شما امکان ذخیره‌سازی فایل‌های حجیم را می‌دهد. این لپ تاپ دارای پورت‌های متنوعی نظیر پورت Thunderbolt 4 و یک پورت HDMI است که به شما امکان اتصال به انواع دستگاه‌های دیگر را می‌دهد. همچنین، این لپ تاپ دارای باتری داخلی با عمر طولانی است که به شما اجازه می‌دهد در هنگام سفر راحت و بدون نیاز به شارژر با آن کار کنید. به طور کلی، لپ تاپ MacBook Pro MNWA3 2023 یک انتخاب عالی برای کاربران حرفه‌ای و علاقه‌مندان به محصولات بالارده و مدرن است.",
        "stock" => "11",
        "colors" => ["مشکی", "طوسی"]
    ],
    [
        "name" => "Surface Studio-i7 ",
        "image" => "https://dkstatics-public.digikala.com/digikala-products/e1dac5451b662193077c42d63e2c8cd479165d7f_1690020375.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
        "description" => "لپ تاپ Surface Studio از سری لپ‌تاپ‌های شرکت مایکروسافت است که به توجه به مشخصات خود می‌تواند گزینه‌ای عالی برای طراحی و ادیت لقب بگیرد. صفحه نمایش لمسی 14.4 اینچی این لپ تاپ با پشتیبانی از قلم و همچنین پنل PixelSense، دارای رزولوشن تصویر خیره‌کننده‌ی 2400x 1600 پیکسل است. علاوه بر این، نرخ به‌روزرسانی تصویر 120 هرتزی این لپ تاپ می‌تواند آن را به گزینه‌ای ایده آل برای ادیت ویدیو تبدیل کند. از طرفی دیگر، برای این لپ تاپ از پردازنده مرکزی قدرتمند سری Core i7 اینتل با مدل 11370H استفاده شده است و پردازنده‌ی گرافیکی قدرتمند انویدیا مدل GeForce RTX A2000 هم آن را به محصولی خاص تبدیل می‌کند. ناگفته نماند که 32 گیگابایت رم از نوع DDR4 و یک ترابایت حافظه SSD در نظر گرفته شده برای این لپ تاپ، سرعت بسیار بالای آن در انجام امور مختلف را تضمین می‌کنند.",
        "stock" => "7",
        "colors" => ["مشکی", "طوسی"]
    ]
];
?>